step-by-step/030-populate-database/020-soap/1500-устройства/0600.xml

<?xml version="1.0" ?>
<!-- Модули -> Интернет -> Устройства и ресурсы -> Дерево -> Вставить из библиотеки -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:inetDeviceUpdate xmlns:common="http://common.bitel.ru"
                              xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <inetDevice xmlns="" deviceTypeId="2" entityId="0" entitySpecId="0" id="0" ident="192.168.99.1"
                        orderManagerDisabled="false" parentId="3">
                <comment></comment>
                <config></config>
                <host>192.168.99.1</host>
                <password>admin</password>
                <secret>secret</secret>
                <username>admin</username>
                <invConfig></invConfig>
                <invDeviceGroupIds>3</invDeviceGroupIds>
                <invDeviceId>4</invDeviceId>
                <invDeviceTypeId>2</invDeviceTypeId>
                <invHost>192.168.99.1</invHost>
                <invIdentifier>192.168.99.1</invIdentifier>
            </inetDevice>
            <updateInvDevice xmlns="">false</updateInvDevice>
        </ns5:inetDeviceUpdate>
    </S:Body>
</S:Envelope>
